Repository: CofficLab/Lumi
Catalog: Packages/PluginAppStorePromoDesigner/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: Adding Languages
zh_hans: 添加语言
zh_hk: 新增語言

source: APP
zh_hans: 应用
zh_hk: 应用

source: App Store Promo Designer
zh_hans: App Store 宣传图设计器
zh_hk: App Store 推廣圖設計器

source: Ask the AI to review the image and apply its suggestions before exporting.
zh_hans: 导出前建议让 AI 检查宣传图,并按建议修改。
zh_hk: 匯出前建議讓 AI 檢查宣傳圖,並按建議修改。

source: Ask the AI to translate and adapt the copy for the new language.
zh_hans: 让 AI 为新语言翻译并调整文案。
zh_hk: 讓 AI 為新語言翻譯並調整文案。

source: Available sizes: iPhone 6.7" (1290×2796), iPhone 6.5" (1284×2778), iPhone 6.1" / 5.8" (1170×2532), iPad Pro 12.9" (2048×2732), iPad Pro 11" (1668×2388), and Desktop (1280×800).
zh_hans: 可选尺寸:iPhone 6.7 英寸(1290×2796)、iPhone 6.5 英寸(1284×2778)、iPhone 6.1 / 5.8 英寸(1170×2532)、iPad Pro 12.9 英寸(2048×2732)、iPad Pro 11 英寸(1668×2388)、桌面(1280×800)。
zh_hk: 可選尺寸:iPhone 6.7 吋(1290×2796)、iPhone 6.5 吋(1284×2778)、iPhone 6.1 / 5.8 吋(1170×2532)、iPad Pro 12.9 吋(2048×2732)、iPad Pro 11 吋(1668×2388)、桌面(1280×800)。

source: Available sizes: iPhone 6.7\" (1290×2796), iPhone 6.5\" (1284×2778), iPhone 6.1\" / 5.8\" (1170×2532), iPad Pro 12.9\" (2048×2732), iPad Pro 11\" (1668×2388), and Desktop (1280×800).
zh_hans: 可用尺寸：iPhone 6.7" (1290×2796)、iPhone 6.5" (1284×2778)、iPhone 6.1" / 5.8" (1170×2532)、iPad Pro 12.9" (2048×2732)、iPad Pro 11" (1668×2388)，以及桌面 (1280×800)。
zh_hk: 可用尺寸：iPhone 6.7" (1290×2796)、iPhone 6.5" (1284×2778)、iPhone 6.1" / 5.8" (1170×2532)、iPad Pro 12.9" (2048×2732)、iPad Pro 11" (1668×2388)，以及桌面 (1280×800)。

source: Choose Add Language from the language picker.
zh_hans: 在语言选择器中选择「添加语言」。
zh_hk: 在語言選擇器中選擇「新增語言」。

source: Click Export and choose a folder.
zh_hans: 点击「导出」,并选择保存文件夹。
zh_hk: 點按「匯出」,並選擇儲存資料夾。

source: Click Refresh in the toolbar if the list or preview looks out of date.
zh_hans: 列表或预览未更新时,点击工具栏中的「刷新」。
zh_hk: 列表或預覽未更新時,點按工具列中的「重新整理」。

source: Core Capabilities
zh_hans: 核心能力
zh_hk: 核心能力

source: Create promotional images from a natural-language brief.
zh_hans: 根据自然语言需求生成推广图。
zh_hk: 根據自然語言需求生成推廣圖。

source: Creating a Promo Image
zh_hans: 创建宣传图
zh_hk: 建立宣傳圖

source: Describe your app and what to highlight in the chat, e.g. "a promo image for a coffee tracker, highlight the brew timer".
zh_hans: 在聊天中描述应用与要突出的内容,例如「为一个咖啡记录应用创建宣传图,突出冲煮计时功能」。
zh_hk: 在聊天中描述應用程式與要突出的內容,例如「為一個咖啡記錄應用程式建立宣傳圖,突出沖煮計時功能」。

source: Describe your app and what to highlight in the chat, e.g. \"a promo image for a coffee tracker, highlight the brew timer\".
zh_hans: 在对话框中描述你的 App 及要突出的重点，例如「一款咖啡追踪器的宣传图，突出冲泡计时器」。
zh_hk: 在对话框中描述你的 App 及要突出的重点，例如「一款咖啡追踪器的宣传图，突出冲泡计时器」。

source: Detail
zh_hans: 详情
zh_hk: 详情

source: Display
zh_hans: 显示
zh_hk: 显示

source: Editing Content
zh_hans: 修改内容
zh_hk: 修改內容

source: Exact Export Sizes
zh_hans: 精确导出尺寸
zh_hk: 精确导出尺寸

source: Exact sizes
zh_hans: 精确尺寸
zh_hk: 精確尺寸

source: Exporting
zh_hans: 导出
zh_hk: 匯出

source: Figure 1: Interface layout
zh_hans: 图 1 界面布局
zh_hk: 圖 1 介面說明

source: Figure 2: Right-click a block to edit it
zh_hans: 图 2 右键点击区块即可修改
zh_hk: 圖 2 右鍵點按區塊即可修改

source: Figure 3: Exports grouped by language
zh_hans: 图 3 按语言分组的导出结果
zh_hk: 圖 3 按語言分組的匯出結果

source: Hero
zh_hans: 主视觉
zh_hk: 主视觉

source: HTML Source
zh_hans: HTML 源码
zh_hk: HTML 源码

source: Images are exported as PNGs at the selected size, grouped into folders by language.
zh_hans: 图片将按所选尺寸导出为 PNG,并按语言分文件夹存放。
zh_hk: 圖片將按所選尺寸匯出為 PNG,並按語言分資料夾存放。

source: In App: stored in the app and available in every project.
zh_hans: APP 内:保存在应用中,所有项目均可使用。
zh_hk: APP 內:保存在應用程式中,所有專案均可使用。

source: In Preview mode, right-click the headline or the screenshot area to draft an edit request for that block.
zh_hans: 预览模式下,右键点击标题或截图区域,可快速生成对应区块的修改请求。
zh_hk: 預覽模式下,右鍵點按標題或截圖區域,可快速生成對應區塊的修改請求。

source: In Project: stored with the current project and available only to it.
zh_hans: 项目内:保存在当前项目中,仅该项目可用。
zh_hk: 專案內:保存在目前的專案中,僅該專案可用。

source: Independent localized versions of every artwork.
zh_hans: 每张推广图都有独立的多语言版本。
zh_hk: 每張推廣圖都有獨立的多語言版本。

source: Interface
zh_hans: 界面说明
zh_hk: 介面說明

source: Launch Campaign
zh_hans: 发起推广
zh_hk: 发起推广

source: Mode
zh_hans: 模式
zh_hk: 模式

source: Multi-language
zh_hans: 多语言
zh_hk: 多語言

source: Notes
zh_hans: 注意事项
zh_hk: 注意事項

source: OK
zh_hans: 确定
zh_hk: 确定

source: Open the promo designer tab in the sidebar.
zh_hans: 打开侧边栏中的「宣传图」标签。
zh_hk: 開啟側邊欄中的「宣傳圖」標籤。

source: Overview
zh_hans: 概述
zh_hk: 概述

source: Preview
zh_hans: 预览区
zh_hk: 預覽區

source: Preview: shows the image at the selected display size.
zh_hans: 预览区:按所选设备尺寸显示宣传图效果。
zh_hk: 預覽區:按所選裝置尺寸顯示宣傳圖效果。

source: Product screenshots must be provided by you; ask the AI to import them.
zh_hans: 宣传图中的产品截图需由您提供,可让 AI 导入。
zh_hk: 宣傳圖中的產品截圖需由您提供,可讓 AI 匯入。

source: Promo Artwork
zh_hans: 推广图
zh_hk: 推廣圖

source: Promo tab in the sidebar
zh_hans: 侧边栏中的推广图标签页
zh_hk: 側邊欄中的推廣圖標籤頁

# Prompt.Suggestion.Create
source: Create an App Store promo image for me
zh_hans: 帮我创建一张 App Store 宣传图
zh_hk: 幫我製作一張 App Store 宣傳圖

source: Render at precise App Store display sizes.
zh_hans: 按精确的 App Store 显示尺寸渲染。
zh_hk: 按精確的 App Store 顯示尺寸渲染。

source: Review the generated image in the preview.
zh_hans: 在预览区查看生成的宣传图。
zh_hk: 在預覽區檢視產生的宣傳圖。

source: Select a display size in the toolbar.
zh_hans: 在工具栏选择设备尺寸。
zh_hk: 在工具列選擇裝置尺寸。

source: Senior Design Review
zh_hans: 资深设计评审
zh_hk: 資深設計評審

source: Sidebar
zh_hans: 侧边栏
zh_hk: 側邊欄

source: Sidebar: the task list, grouped into In Project and In App.
zh_hans: 侧边栏:任务列表,分为「项目内」与「APP 内」两组。
zh_hk: 側邊欄:任務列表,分為「專案內」與「APP 內」兩組。

source: State changes in the conversation, such as copy, colors, or layout.
zh_hans: 在对话中说明修改要求,如文案、配色或布局。
zh_hk: 在對話中說明修改要求,如文案、配色或版面配置。

source: Storage
zh_hans: 存储位置
zh_hk: 儲存位置

source: Structured critique with concrete revision suggestions.
zh_hans: 结构化评审意见与具体修改建议。
zh_hk: 結構化評審意見與具體修改建議。

source: This manual covers the interface and basic operations of the App Store Promo Designer: creating, editing, localizing, and exporting promo screenshots.
zh_hans: 本手册介绍 App Store 宣传图设计器的界面与基本操作,包括创建、修改、多语言与导出宣传截图。
zh_hk: 本手冊介紹 App Store 宣傳圖設計器的介面與基本操作,包括建立、修改、多語言與匯出宣傳截圖。

source: Toolbar
zh_hans: 工具栏
zh_hk: 工具列

source: Toolbar: language picker, display size picker, Preview / HTML Source switch, Refresh, and Export.
zh_hans: 工具栏:语言选择器、设备尺寸选择器、「预览 / HTML 源码」切换、刷新与导出按钮。
zh_hk: 工具列:語言選擇器、裝置尺寸選擇器、「預覽 / HTML 原始碼」切換、重新整理與匯出按鈕。

source: User Manual
zh_hans: 使用手册
zh_hk: 使用手冊

source: Where to Find It
zh_hans: 使用入口
zh_hk: 使用入口

source: Create App Store promo images and marketing assets.
zh_hans: 制作 App Store 推广图与宣传素材。
zh_hk: 製作 App Store 推廣圖與宣傳素材。

source: Add Language
zh_hans: 添加语言

source: Agent-generated HTML promotional artwork with exact App Store export sizes.
zh_hans: 通过 Agent 生成 HTML 宣传图，并按 App Store 精确尺寸导出。

source: Ask the Agent to create a promotional artwork task.
zh_hans: 请让 Agent 创建一个宣传图任务。

source: Delete Image
zh_hans: 删除图片

source: Delete Task
zh_hans: 删除任务

source: Export
zh_hans: 导出

source: Export Failed
zh_hans: 导出失败

source: images
zh_hans: 张图片

source: In App
zh_hans: APP 内

source: In Project
zh_hans: 项目内

source: No images yet
zh_hans: 还没有图片

source: Open a project to enable project-local storage.
zh_hans: 打开项目以启用项目本地存储。

source: Plugin storage is unavailable.
zh_hans: 插件存储不可用。

source: Preview Language
zh_hans: 预览语言

source: Promo Tasks
zh_hans: 宣传图

source: Refresh
zh_hans: 刷新
